# -*- coding: utf-8 -*-
"""
Created on Wed Sep  2 21:18:26 2015

@author: deokwooj
"""

"""
* Description 
- This file defines global constant symbols and definitions used through in this program. 
- Should be included all python modules first. 
"""
import data_tools as nt

__author__ = "Deokwoo Jung"
__copyright__ = "Copyright 2015, Deokwoo Jung, All rights reserved."
__credits__ = ["Deokwoo Jung"]
__license__ = "GPL"
__version__ = "1.0.1"
__maintainer__ = "Deokwoo Jung"
__email__ = "deokwooj@gmail.com"
__status__ = "Development"

# Define media code dictionary
#(media name, media id)
media_code={\
'강원도민일보':'01300101',\
'강원일보':'01300201',\
'경기일보':'01200101',\
'경남도민일보':'01500151',\
'경남신문':'01500051',\
'경상일보':'01500301',\
'경인일보':'01200201',\
'경향신문':'01100101',\
'광주일보':'01600301',\
'국민일보':'01100201',\
'국제신문':'01500401',\
'기자협회보':'07100702',\
'김포뉴스':'5200752',\
'내일신문':'01100301',\
'당진시대':'05520352',\
'대덕넷' :'04400108',\
'대전일보':'01400201',\
'매일신문':'01500601',\
'무등일보':'01600501',\
'미디어오늘':'07100251',\
'문화일보':'01100501',\
'부산일보':'01500701',\
'브레이크뉴스':'04100608',\
'새전북신문':'01600601',\
'서울신문':'01100601',\
'세계일보':'01100701',\
'한국경제':'02100601',\
'한국재경신문':'04101358',\
'시사인':'06100252',\
'MBC':'08100201',\
'KNN':'08520101',\
'머니투데이':'02100201',\
'오마이뉴스':'04100908',\
'헤럴드경제':'02100701',\
'스포츠서울':'10100101',\
'스포츠칸':'10100201',\
'영남일보':'01500801',\
'옥천신문':'05410052',\
'이데일리':'04101008',\
'인천일보':'01200401',\
'전남일보':'01600801',\
'전북도민일보':'01601001',\
'전북일보':'01601101',\
'제민일보':'01700101',\
'중도일보':'01400351',\
'중부매일':'01400401',\
'충북일보':'01400551',\
'충청투데이':'01400701',\
'파이낸셜뉴스':'02100501',\
'평택문화신문':'05202702',\
'한겨레':'01101001',\
'한라일보':'01700201',\
'홍성신문':'05420702',\
'PD저널':'07100602',\
'아시아투데이':'01100751',\
'한국일보':'01101101',\
'매일경제':'02100101',\
'서울경제':'02100301',\
'이투데이':'02100351',\
'프라임경제':'02100563',\
'투데이코리아':'04101258',\
'국방일보':'04103008',\
'KBS':'08100101',\
'SBS':'08100301',\
'동아일보':'01100401',\
'노컷뉴스':'04100058',\
'조세일보':'04101208',\
'코리아헤럴드':'03100101'\
}



# Define news source cateory dictionary
#(organization name, organization id)
ns_category={\
'법원':'111',\
'검찰':'211',\
'변호사':'311',\
'경찰소방':'411',\
'정당':'121',\
'국회':'221',\
'청와대':'131',\
'행정부':'231',\
'지자체':'331',\
'정부출연':'431',\
'정치인':'141',\
'북한':'241',\
'군대':'341',\
'국제기구':'441',\
'농림수산':'112',\
'광업':'212',\
'에너지':'312',\
'IT전자':'122',\
'차선박항공':'222',\
'건설업':'322',\
'중소기업':'422',\
'석유화학':'522',\
'제약':'722',\
'제철':'622',\
'패션식품마트':'132',\
'금융':'232',\
'서비스업':'332',\
'병원':'532',\
'자영업':'432',\
'관광외식':'532',\
'운송':'632',\
'협회':'142',\
'노조':'152',\
'직장인':'252',\
'교육기관':'113',\
'과학기술계':'213',\
'인문사회계':'313',\
'학원':'513',\
'의료계':'413',\
'카톨릭계기독교계':'123',\
'불교계':'223',\
'유림천도교원불교':'323',\
'통일교이슬람교기타':'423',\
'미술계':'133',\
'문학':'233',\
'음악계':'333',\
'문화재':'433',\
'연극계공연계행위예술':'633',\
'예술계기타':'533',\
'언론계':'143',\
'연예계':'243',\
'평론가':'343',\
'광고계':'443',\
'프로스포츠':'153',\
'스포츠용품':'353',\
'아마추어스포츠':'253',\
'정치관련':'114',\
'경제관련':'214',\
'문화친목':'314',\
'봉사자선환경':'414',\
'주민자치기타':'514',\
'버스':'144',\
'지하철철도':'244',\
'택시':'344',\
'대중교통기타':'544',\
'여객선':'444',\
'일반인네티즌':'124',\
'소비자':'224',\
'범죄자':'324',\
'북미유럽정치':'115',\
'북미유럽경제':'215',\
'북미유럽사회문화기타':'315',\
'동아시아오세아니아정치':'125',\
'동아시아오세아니아경제':'225',\
'동아시아오세아니아사회문화기타':'325',\
'중동아프리카정치':'135',\
'중동아프리카경제':'235',\
'중동아프리카사회문화기타':'335',\
'남미정치':'145',\
'남미경제':'245',\
'남미사회문화기타':'345'\
}


"""
#noun_dict={1:'대한민국', 2:'분단','3:북한',....so on}
noun_dict_temp_1=nt.loadObjectBinaryFast(DICT_SPLIT_ARR_NOUNS)
noun_dict_temp_2=nt.loadObjectBinaryFast(DICT_NOUNS)

all_nouns=[]
for key in noun_dict_temp.iteritems():
    print key[0]
    print '---------------'
    for wd in key[1]:
        all_nouns.append(wd)
noun_dict={}
for i,noun in enumerate(set(all_nouns)):
    noun_dict.update({i:noun})
"""


# 
#for key, noun in noun_dict.iteritems():
#    print key, noun
